# GetProfile Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExtrusionRoof..::..GetProfile Method
ExtrusionRoof Class See Also
---
Retrieve the Profile of ExtrusionRoof.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ModelCurveArray GetProfile()
```

Visual Basic
---
```text
Public Function GetProfile As ModelCurveArray
```

Visual C++
---
```text
public:
ModelCurveArray^ GetProfile()
```

# See Also
ExtrusionRoof Class
Autodesk.Revit.DB Namespace